20230326190222-ebitengine.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-01-01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Ebitengine</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">Ebitengine</h1>
<div id="outline-container-orga940317" class="outline-2">
<h2 id="orga940317"><a href="#orga940317">概要</a></h2>
<div class="outline-text-2" id="text-orga940317">
<p>
Ebitengineは<a href="20210911113057-go.html#ID-7cacbaa3-3995-41cf-8b72-58d6e07468b1">Go</a>の2Dゲームエンジン。
</p>
</div>
</div>
<div id="outline-container-orgb02445b" class="outline-2">
<h2 id="orgb02445b"><a href="#orgb02445b">Memo</a></h2>
<div class="outline-text-2" id="text-orgb02445b">
</div>
<div id="outline-container-orgaa8eef1" class="outline-3">
<h3 id="orgaa8eef1"><a href="#orgaa8eef1">依存関係インストール</a></h3>
<div class="outline-text-3" id="text-orgaa8eef1">
<p>
表示まわりの依存ライブラリがある。
</p>
<ul class="org-ul">
<li><a href="https://ebitengine.org/en/documents/install.html?os=linux">Install - Ebitengine</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org250832c" class="outline-2">
<h2 id="org250832c"><a href="#org250832c">Tasks</a></h2>
<div class="outline-text-2" id="text-org250832c">
</div>
<div id="outline-container-org5578fc0" class="outline-3">
<h3 id="org5578fc0"><a href="#org5578fc0"><span class="todo TODO">TODO</span> pongを読んでみる</a></h3>
<div class="outline-text-3" id="text-org5578fc0">
<ul class="org-ul">
<li><a href="https://github.com/drpaneas/pong">drpaneas/pong: Make the old-time classic game &rsquo;pong&rsquo; using Go &amp; Ebitenengine</a></li>
</ul>

<p>
どういう感じにするのがいいのかざっくり見てみる。
</p>
</div>
</div>
</div>
<div id="outline-container-org5a82a31" class="outline-2">
<h2 id="org5a82a31"><a href="#org5a82a31">Reference</a></h2>
</div>
<div id="outline-container-org3222473" class="outline-2">
<h2 id="org3222473"><a href="#org3222473">Archives</a></h2>
<div class="outline-text-2" id="text-org3222473">
</div>
<div id="outline-container-orgd035fb0" class="outline-3">
<h3 id="orgd035fb0"><a href="#orgd035fb0"><span class="done DONE">DONE</span> 画像テストを試す</a></h3>
<div class="outline-text-3" id="text-orgd035fb0">
<p>
入門のついでにリグレッションテストを試す。できたのだが、テストと実際に起動する用をどう分ければいいのかよくわからないな。
</p>

<ul class="org-ul">
<li>interface ebiten.Game を満たす構造体、メソッドで分けるのはわかる。そこは分けてよさそう。しかし本質的ロジックはどこに書けばいいのだろう</li>
<li>UpdateとかDrawに処理があるときは、完全に重複して書かないといけなそうな感じ</li>
<li>純粋に画像をいじる関数しかテストできないな</li>
<li>Updateに関しては、普通のテストでもある程度検証できそうな感じはする</li>
<li>m.Run()はテスト前に必ず実行されるフック。Update()内で実行することで、テストする前にUpdateまで実行されるようになる。これがないとウィンドウが出ず、画像が保存できなくなる。テストの中で書かれているのはメインテーマの関数から画像を作りだすことだけで、本来の実行の流れとは異なる</li>
<li>なぜ、テストを先に動かしておくと画像実行できるのか.。テストとウィンドウを立ち上げる処理はコード的に関係ないように見える。わからん</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
